Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/introduction_to_the_irish_system/tax_ireland.html.txt.tmx
Source language: en
Languages: ga

source: If you are coming to live in Ireland, depending on your personal circumstances, there are different taxes which you may have to pay
ga: Má thagann tú go hÉirinn chun cónaí ann, tá cánacha éagsúla ann nach mór duit a íoc, ag brath ar do chúinsí pearsanta

source: The Revenue Commissioners, also known as Revenue, are the government body who assess and collect taxes and duties in Ireland
ga: Is iad na Coimisinéirí Ioncaim an comhlacht rialtais a dhéanann cánacha agus dleachtanna a mheas agus a bhailiú in Éirinn

source: You need to have a Personal Public Service Number (PPS number) when taking up employment or self-employment
ga: Is gá duit uimhir Phearsanta Seirbhíse Poiblí (PSP) a bheith agat nuair a ghlacann tú le fostaíocht nó le féinfhostaíocht

source: Employees and self-employed people aged under 66 pay social insurance (PRSI) contributions in addition to taxes
ga: Íocann fostaithe agus daoine féinfhostaithe faoi bhun aois 66 bliain ranníocaíochtaí árachais shóisialaigh phá-choibhneasta (ÁSPC) anuas ar chánacha

source: Nearly all income is liable to tax
ga: Tá an t-ioncam go léir, nach mór, faoi dhliteanas cánach

source: The first part of your income, up to a certain amount, is taxed at the standard rate of tax
ga: Gearrtar cáin ar an gcéad chuid de d’ioncam, a mhéid le suim áirithe, ar an ráta caighdeánach cánach

source: The remainder of your income is taxed at the higher rate of tax
ga: Gearrtar an t-ardráta cánach ar fhuílleach d’ioncaim

source: You can read more in our document on how your income tax is calculated
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar conas a ríomhtar do cháin ioncaim

source: Employees have income tax deducted from their pay under the Pay As You Earn (PAYE) system by their employer. You can read more in our document on tax and starting work
ga: Asbhaineann a bhfostóir cáin ó phá fostaithe faoin gcóras Íoc mar a Thuillir (ÍMAT) Féadfaidh tú níos mó a léamh inár gcáipéis ar cháin agus obair a thosú

source: Employees who have income from other sources must pay tax on this
ga: Má bhíonn ioncam ó fhoinsí eile ag fostaithe, ní mór dóibh cáin a íoc air seo

source: Self-employed people pay income tax under the self-assessment system on the profits from their business and on any other income that they have
ga: Íocann daoine féinfhostaithe cáin ioncaim faoin gcóras féinmheasúnaithe ar na brabúis óna ngnólacht agus ar aon ioncam eile atá acu

source: Read more in our document on tax and self-employed people
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar cháin agus daoine féinfhostaithe

source: Tax credits and reliefs reduce the amount of tax you have to pay
ga: Laghdaíonn creidmheasanna agus faoisimh chánach an méid cánach atá le híoc agat

source: Tax is calculated as a percentage of your income
ga: Ríomhtar cáin mar chéatadán de d’ioncam

source: Your tax credits are deducted from this to give the amount of tax that you have to pay, for example, your personal tax credit
ga: Asbhaintear do chreidmheasanna cánach uaidh seo chun an méid cánach is gá duit a íoc a ríomh, mar shampla, do chreidmheas pearsanta cánach

source: In some cases you can get relief for specific expenses, for example, medical expenses
ga: I gcásanna áirithe, féadfaidh tú faoiseamh a fháil le haghaidh costais ar leith, mar shampla, costais leighis

source: You can read more in our document on tax credits and reliefs
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar chreidmheasanna agus faoisimh chánach

source: The Universal Social Charge (USC) is a tax on your income that is charged on your gross income before any pension or PRSI contributions are deducted
ga: Cáin atá sa Mhuirear Sóisialta Uilíoch (MSU) ar d’ioncam a ghearrtar ar d’ollioncam sula n-asbhaintear aon ranníocaíochtaí pinsin nó ÁSPC

source: Find out more in our document on the Universal Social Charge
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar an Muirear Sóisialta Uilíoch

source: You may have to pay Capital Acquisitions Tax on any gift or inheritances that you receive
ga: B’fhéidir go mbeidh ort Cáin Fháltas Caipitiúil a íoc ar aon bhronntanas nó aon oidhreacht a fhaigheann tú

source: If you own a residential property in Ireland you are liable for payment of Local Property Tax
ga: Má tá maoin chónaithe in Éirinn agat, tá tú faoi dhliteanas Cáin Mhaoine Áitiúil a íoc

source: If you earn interest on savings then you pay a tax on the interest called Deposit Interest Retention Tax (DIRT)
ga: Má thuilleann tú ús ar choigiltí, íocann tú cáin ar an ús, ar a dtugtar Cáin Choinneála ar Ús Taisce (DIRT)

source: In general, if you buy a new car or if you import a car into Ireland, it is liable for Vehicle Registration Tax (VRT) and must be registered with Revenue
ga: Go ginearálta, má cheannaíonn tú gluaisteán nua nó má iompórtálann tú gluaisteán isteach go hÉirinn, beidh sé faoi dhliteanas Cáin Chláraithe Feithiclí (CCF) agus ní mór é a chlárú leis na Coimisinéirí Ioncaim

source: You must also pay motor tax if you want to drive your vehicle in a public place
ga: Chomh maith leis sin, ní mór duit mótarcháin a íoc más mian leat d’fheithicil a thiomáint in áit phoiblí

source: Your liability for tax in Ireland can be affected by whether you are resident in the country and whether Ireland is your permanent home
ga: Is féidir le cé acu an gcónaíonn nó nach gcónaíonn tú sa tír agus cé acu an í nó nach í Éire d’áit bhuan chónaithe tionchar a imirt ar do dhliteanas le haghaidh cánach in Éirinn

source: Generally you will be charged Irish tax on your world-wide income earned or arising in a tax year during which you are resident, ordinarily resident or domiciled in Ireland for tax purposes
ga: Go ginearálta, gearrfar cáin Éireannach ar d’ioncam domhanda a thuill tú nó a thagann aníos i gcaitheamh na bliana cánach ina bhfuil cónaí, gnáthchónaí no sainchónaí ort in Éirinn ar mhaithe le cuspóirí cánach

source: You can read more in our document on tax residence and domicile
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar chónaí agus sainchónaí cánach in Éirinn

source: As a particular item of income can be taxable in both the country where it is sourced and also in the country in which you, as the recipient, are resident, Ireland has a number of double taxation agreements with other countries in order to avoid double taxation
ga: Mar gheall gur féidir cáin a ghearradh ar earra áirithe ioncaim sa tír ina bhfuil sé foinsithe agus sa tír ina bhfuil cónaí ort, an faighteoir, tá roinnt comhaontaithe um chánachas dúbailte ag Éirinn le líon tíortha eile chun cánachas dúbailte a sheachaint

source: Find out more in our document on coming to live in Ireland and tax
ga: Féadfaidh tú níos mó a léamh inár gcáipéis ar theacht go hÉireann chun cónaí ann agus cáin

source: A guide to the Irish tax system for people who are moving to Ireland is available on the Revenue website, revenue.ie
ga: Tá treoir maidir le córas cánach na hÉireann do dhaoine atá ag bogadh go hÉirinn ar fáil ar láithreán gréasáin na gCoimisinéirí Ioncaim, revenue.ie

source: For more information you can contact your tax office
ga: Chun teacht ar bhreis faisnéise, féadfaidh tú teagmháil a dhéanamh le d’oifig chánach
